In [55]:
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

import pandas as pd
import numpy as np
import sqlite3

In [83]:
users = pd.read_csv('data/Users.csv')
daily_listening_activity = pd.read_csv('data/DailyListeningActivity.csv')

feature_exposure = pd.read_csv('data/FeatureExposure.csv')

subscriptions = pd.read_csv('data/Subscriptions.csv')

In [84]:
import sqlite3

conn = sqlite3.connect("analysis.db")

users.to_sql("users", conn, if_exists="replace", index=False)
daily_listening_activity.to_sql("daily_listening_activity", conn, if_exists="replace", index=False)
feature_exposure.to_sql("feature_exposure", conn, if_exists="replace", index=False)
subscriptions.to_sql("subscriptions", conn, if_exists="replace", index=False)

1000

60000

1000

74

In [85]:
pd.read_sql("SELECT COUNT(*) FROM users;", conn)
pd.read_sql("SELECT COUNT(*) FROM feature_exposure;", conn)
pd.read_sql("SELECT COUNT(*) FROM daily_listening_activity;", conn)
pd.read_sql("SELECT COUNT(*) FROM subscriptions;", conn)

   COUNT(*)
0      1000

   COUNT(*)
0      1000

   COUNT(*)
0     60000

   COUNT(*)
0        74

In [86]:
pd.read_sql("PRAGMA table_info(users);", conn)
pd.read_sql("PRAGMA table_info(feature_exposure);", conn)
pd.read_sql("PRAGMA table_info(subscriptions);", conn)
pd.read_sql("PRAGMA table_info(daily_listening_activity);", conn)

   cid                 name  type  notnull dflt_value  pk
0    0              user_id  TEXT        0       None   0
1    1          signup_date  TEXT        0       None   0
2    2  acquisition_channel  TEXT        0       None   0
3    3              country  TEXT        0       None   0
4    4          device_type  TEXT        0       None   0

   cid        name     type  notnull dflt_value  pk
0    0     user_id     TEXT        0       None   0
1    1     exposed  INTEGER        0       None   0
2    2  Unnamed: 2     REAL        0       None   0

   cid            name     type  notnull dflt_value  pk
0    0         user_id     TEXT        0       None   0
1    1  date_purchased     TEXT        0       None   0
2    2      is_premium  INTEGER        0       None   0
3    3         revenue     REAL        0       None   0

   cid               name     type  notnull dflt_value  pk
0    0            user_id     TEXT        0       None   0
1    1      date_listened     TEXT        0       None   0
2    2           sessions  INTEGER        0       None   0
3    3   minutes_listened     REAL        0       None   0
4    4     songs_streamed  INTEGER        0       None   0
5    5  playlists_created  INTEGER        0       None   0

In [87]:
pd.read_sql('SELECT * FROM users LIMIT 5;', conn)
pd.read_sql('SELECT * FROM feature_exposure LIMIT 5;', conn)
pd.read_sql('SELECT * FROM subscriptions LIMIT 5;', conn)
pd.read_sql('SELECT * FROM daily_listening_activity LIMIT 5;', conn)

  user_id signup_date acquisition_channel country device_type
0  user_1  2025-09-10            referral      UK     desktop
1  user_2  2025-10-17                 ads      US      mobile
2  user_3  2025-08-21                 ads      US     desktop
3  user_4  2025-09-01             organic      CA      mobile
4  user_5  2025-10-11                 ads      US     desktop

  user_id  exposed Unnamed: 2
0  user_1        0       None
1  user_2        0       None
2  user_3        0       None
3  user_4        1       None
4  user_5        1       None

   user_id date_purchased  is_premium  revenue
0   user_4     2025-11-23           1     9.99
1  user_20     2025-12-16           1     9.99
2  user_39     2025-12-26           1     9.99
3  user_42     2025-12-22           1     9.99
4  user_49     2025-12-19           1     9.99

,user_id,date_listened,sessions,minutes_listened,songs_streamed,playlists_created
0,user_1,2025-11-01,3,21.5,6,0
1,user_1,2025-11-02,0,31.9,9,0
2,user_1,2025-11-03,2,28.7,8,0
3,user_1,2025-11-04,0,32.5,6,0
4,user_1,2025-11-05,0,29.7,7,0

In [ ]:
pd.read_sql("""
SELECT
    exposed,
    COUNT(DISTINCT user_id) AS users
FROM feature_exposure
GROUP BY exposed;
""", conn)

   exposed  users
0        0    528
1        1    472